"1st program"
print(9**0.5*5) # возведения числа 9 в степень 0.5, после умножение на 5
"2ad program"
print(9.99>9.98 and 1000!=1000.1) # Убедитесь в том что 9.99 больше 9.98 и 1000 не равно 1000.1 одновременно
"3rd program"
print(2*2+2!=2*2+2) # не уверенна ,что к данному ответу пришла верным способом ,т.к не поняла как обозначить приоретит
"4th program"
print(float("123.456")) # преобразование строки в дробное число
print(123.456*10)
x = float = float(123.456)
k = int(1234)
if k == 0:
    y = x * 10
    z = int(y)
    print (z)
if k > 0:
    print (int(10* (x - int(x))))

